# 다음 퀴즈를 수행하시오.

In [3]:
import pandas as pd
df = pd.read_csv("../data/hotel_booking_train_1m.zip")
df.head(2)

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
0,2014-07-07,11,3,205,354,25315,383.3362,163906,0,0,...,2014-08-04,2014-08-08,4,0,2,11569,1,0,1,50
1,2014-09-20,2,3,66,153,20706,2297.5172,201303,1,0,...,2015-01-01,2015-01-03,2,0,1,19137,5,0,1,128

In [4]:
pd.to_datetime(df["srch_ci"][:3]) - pd.to_datetime(df["srch_ci"][:3])

0   0 days
1   0 days
2   0 days
Name: srch_ci, dtype: timedelta64[ns]

### Q1. pandas 모듈을 pd로 불러오시오.

In [5]:
import pandas as pd

### Q2. "hotel_booking_train_1m.zip"을 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [7]:
import pandas as pd
df = pd.read_csv("../data/hotel_booking_train_1m.zip")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 21 columns):
 #   Column                     Non-Null Count    Dtype
---  ------                     --------------    -----
 0   date_time                  1000000 non-null  object
 1   site_name                  1000000 non-null  int64
 2   posa_continent             1000000 non-null  int64
 3   user_location_country      1000000 non-null  int64
 4   user_location_region       1000000 non-null  int64
 5   user_location_city         1000000 non-null  int64
 6   orig_destination_distance  640342 non-null   float64
 7   user_id                    1000000 non-null  int64
 8   is_mobile                  1000000 non-null  int64
 9   is_package                 1000000 non-null  int64
 10  channel                    1000000 non-null  int64
 11  srch_ci                    998867 non-null   object
 12  srch_co                    998867 non-null   object
 13  srch_adults_cnt            1000000 non-null  int64
 14  srch_children_cnt          1000000 non-null  int64
 15  srch_rm_cnt                1000000 non-null  int64
 16  srch_destination_id        1000000 non-null  int64
 17  srch_destination_type_id   1000000 non-null  int64
 18  is_booking                 1000000 non-null  int64
 19  cnt                        1000000 non-null  int64
 20  hotel_country              1000000 non-null  int64
dtypes: float64(1), int64(17), object(3)
memory usage: 160.2+ MB

### Q3. df의 첫 5개 row를 출력하시오

In [8]:
df.head(5)

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
0,2014-07-07,11,3,205,354,25315,383.3362,163906,0,0,...,2014-08-04,2014-08-08,4,0,2,11569,1,0,1,50
1,2014-09-20,2,3,66,153,20706,2297.5172,201303,1,0,...,2015-01-01,2015-01-03,2,0,1,19137,5,0,1,128
2,2014-10-23,2,3,66,442,35390,1139.8157,173990,0,1,...,2014-11-30,2014-12-07,2,1,1,11923,1,0,2,80
3,2013-11-07,37,1,69,923,54859,NaN,584851,0,1,...,2013-12-22,2013-12-27,3,0,2,18965,1,0,1,77
4,2013-02-24,2,3,66,311,5405,3279.1369,1154606,0,1,...,2013-03-01,2013-03-04,1,0,1,8253,1,0,1,70

### Q4. df의 마지막 2개 row를 출력하시오

In [9]:
df.tail(2)

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
999998,2014-11-07,11,3,205,354,2875,1021.9359,192542,0,1,...,2014-12-08,2014-12-13,2,0,1,8268,1,0,4,50
999999,2014-01-14,40,3,66,184,11878,67.5305,543025,0,0,...,2014-06-05,2014-06-06,2,2,1,12196,6,0,1,50

### Q5. df의 차원을 확인하시오

In [10]:
df.ndim

2

### Q6. df의 row 개수를 확인하시오

In [11]:
df.shape[0]

1000000

### Q7. df의 column 개수를 확인하시오

In [16]:
df.shape[1]
# df.columns.size
# df.columns.shape[0]

pandas.core.indexes.base.Index

### Q8. df의 column 이름을 확인하시오

In [17]:
df.columns

Index(['date_time', 'site_name', 'posa_continent', 'user_location_country',
       'user_location_region', 'user_location_city',
       'orig_destination_distance', 'user_id', 'is_mobile', 'is_package',
       'channel', 'srch_ci', 'srch_co', 'srch_adults_cnt', 'srch_children_cnt',
       'srch_rm_cnt', 'srch_destination_id', 'srch_destination_type_id',
       'is_booking', 'cnt', 'hotel_country'],
      dtype='object')

### Q9. 데이터가 수집된 웹 사이트\[site_name\]의 개수를 조사하시오.

In [48]:
df.nunique()["site_name"]

42

### Q10. 데이터가 수집된 대륙\[posa_continent\]은 총 몇 개 인가?

In [25]:
df["posa_continent"].nunique()

5

### Q11. 유입 채널\[channel\]과 예약\[is_booking\]여부 데이터를 기반으로 표(crosstab)을 생성하시오.

In [28]:
pd.crosstab(df["channel"], df["is_booking"])

is_booking       0      1
channel
0           115153   9059
1            94389   6902
2            73920   4724
3            41934   2498
4            19034   2914
5            55890   5744
6             1540     82
7             7939    359
8             2689    243
9           508009  46798
10             168     12

### Q12. 각 검색 데이터를 유입 채널\[channel\]별 예약\[is_booking\] 비율을 계산하고 이를 cross 객체에 저장하시오.

In [51]:
# cross = pd.crosstab(df["channel"], df["is_booking"], normalize="index")
cross = pd.crosstab(df["channel"], df["is_booking"], normalize=0)
cross

is_booking         0         1
channel
0           0.927068  0.072932
1           0.931860  0.068140
2           0.939932  0.060068
3           0.943779  0.056221
4           0.867232  0.132768
5           0.906805  0.093195
6           0.949445  0.050555
7           0.956737  0.043263
8           0.917121  0.082879
9           0.915650  0.084350
10          0.933333  0.066667

---------------------------
여기부터 cross 객체를 기준으로 문제를 해결하시오.

---------------------------
### Q13. 검색당 예약비율이 가장 높은 유입 채널은 몇 번인가?

In [43]:
cross.iloc[:,1].idxmax()

4

### Q14. 검색당 예약 비율이 가장 높은 유입 채널의 예약 비율을 소수점 셋 째 자리까지 반올림하여 구하시오.
(정답 예시: 0.456)

In [57]:
cross.iloc[:,1].max().round(3)
# round(cross.iloc[:,1].max(),3)

0.133

### Q15. 유입 채널별 예약비율 정보를 "hotel_booking_info.csv"에 저장하시오.

In [47]:
cross.to_csv("hotel_booking_info.csv")